# YOLOv5n-p2.yaml
nc: 3  # 修改为3
depth_multiple: 0.33
width_multiple: 0.25
anchors:
  - [4,5, 8,10, 13,16]   # P2/4
  - [10,13, 16,30, 23,33] # P3/8
  - [30,61, 62,45, 59,119] # P4/16
  - [116,90, 156,198, 373,326] # P5/32

backbone:
  [
    [-1, 1, Conv, [64, 6, 2, 2]],   # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]],    # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]],       # 9
  ]

head:
  [
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C3, [256, False]],      # 13

    [-1, 1, Conv, [128, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 2], 1, Concat, [1]],
    [-1, 3, C3, [128, False]],      # 17 (P2/4)

    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 13], 1, Concat, [1]],
    [-1, 3, C3, [256, False]],      # 20 (P3/8)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 6], 1, Concat, [1]],
    [-1, 3, C3, [512, False]],      # 23 (P4/16)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 9], 1, Concat, [1]],
    [-1, 3, C3, [1024, False]],     # 26 (P5/32)

    [[17, 20, 23, 26], 1, Detect, [nc, anchors]],
  ]